# SIRISHA DUDDUKUNTA

## series object in pandas

In [54]:
import pandas as pd

In [3]:
data=[1,2,3,4]

In [4]:
s1=pd.Series(data)
s1

0    1
1    2
2    3
3    4
dtype: int64

In [49]:
type(s1)

pandas.core.series.Series

### Changing the index of Series Object

In [6]:
s1=pd.Series(data,index=['a','b','c','d'])
s1

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
s1['c']

3

In [9]:
s1['a']

1

In [10]:
s1[:2]

a    1
b    2
dtype: int64

In [12]:
s1[-2:]

c    3
d    4
dtype: int64

In [13]:
d1= {'a':1,'b':2,'c':3,'d':4}
d1

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [14]:
s2=pd.Series(d1)
s2

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
s2=pd.Series(d1,index=['d','c','b','a'])
s2

d    4
c    3
b    2
a    1
dtype: int64

## creating dataframe

In [17]:
data=[1,2,3,4]

In [18]:
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

## Importing and analysing dataset

In [102]:

data=pd.read_csv("C:\\Users\\siris\\OneDrive\\Desktop\\New folder\employees.csv")

In [103]:
# returns five rows of dataframe
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [104]:
# returns last rows of dataframe
data.tail()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [30]:
data.iloc[5:15,2:5]

    Start Date Last Login Time  Salary
5    4/18/1987         1:35 AM  115163
6    8/17/1987         4:20 PM   65476
7    7/20/2015        10:43 AM   45906
8   11/22/2005         6:29 AM   95570
9     8/8/2002         6:51 AM  139852
10   8/12/1980         9:01 AM   63241
11  10/26/1997         3:19 PM  102508
12   12/1/1980         1:08 AM  112807
13   1/27/2008        11:40 PM  109831
14   1/14/1999         7:13 AM   41426

In [61]:
cust=data[data['Gender']=='Female']
cust.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development

In [98]:
data_m=data[(data['Salary']>65476)&(data['Team']=="Finance")]

In [100]:
# view first 10 rows of dataframe
data_m.head(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
46,Bruce,Male,11/28/2009,10:47 PM,114796,6.796,False,Finance
56,Carl,Male,5/3/2006,5:55 PM,130276,16.084,True,Finance
68,Jose,Male,10/30/2004,1:39 PM,84834,14.330,True,Finance
69,Irene,NaN,7/14/2015,4:31 PM,100863,4.382,True,Finance
83,Shawn,Male,9/23/2005,2:55 AM,148115,6.539,True,Finance
84,Doris,Female,8/20/2004,5:51 AM,83072,7.511,False,Finance
96,Cynthia,Female,3/21/1994,8:34 AM,142321,1.737,False,Finance
103,Phyllis,Female,10/11/1996,9:30 PM,136984,8.932,True,Finance

In [101]:
# view last 10 rows of dataframe
data_m.tail(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
884,Lisa,Female,10/17/2003,1:42 PM,73706,18.530,False,Finance
889,Margaret,Female,1/4/2001,3:07 AM,126924,1.552,True,Finance
890,NaN,Male,11/24/2015,3:11 AM,145329,7.100,NaN,Finance
891,Timothy,Male,8/25/1991,10:37 AM,92587,8.475,False,Finance
897,Kenneth,NaN,2/28/1994,10:10 AM,95296,10.146,False,Finance
905,Alice,Female,2/9/2013,12:49 AM,121250,4.363,True,Finance
907,Elizabeth,Female,7/27/1998,11:12 AM,137144,10.081,False,Finance
954,Joe,Male,1/19/1980,4:06 PM,119667,1.148,True,Finance
987,Gloria,Female,12/8/2014,5:08 AM,136709,10.331,True,Finance
992,Anthony,Male,10/16/2011,8:35 AM,112769,11.625,True,Finance

In [97]:
# view number of rows and columns  in dataframe
data.shape

(1000, 8)

In [105]:
data.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [106]:
data.mean()

Salary               90662.181000
Bonus %                 10.207555
Senior Management        0.501608
dtype: float64

In [108]:
data.median()

Salary               90428.0000
Bonus %                  9.8385
Senior Management        1.0000
dtype: float64

In [109]:
data.std()

Salary               32923.693342
Bonus %                  5.528481
Senior Management        0.500266
dtype: float64

In [110]:
data.max()

Start Date           9/9/2006
Last Login Time       9:59 AM
Salary                 149908
Bonus %                19.944
Senior Management        True
dtype: object

In [111]:
data.min()

Start Date           1/1/2014
Last Login Time      10:00 AM
Salary                  35013
Bonus %                 1.015
Senior Management       False
dtype: object

In [113]:
#number of non null values in dataframe
data.count()

First Name            933
Gender                855
Start Date           1000
Last Login Time      1000
Salary               1000
Bonus %              1000
Senior Management     933
Team                  957
dtype: int64

In [114]:
#describe stastics summary
data.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

## Creating a dataframe using a dictionary

In [19]:
fruit={'fruits':['apple','mango','banana','guava'],'count':[10,20,30,40]}
fruit

{'fruits': ['apple', 'mango', 'banana', 'guava'], 'count': [10, 20, 30, 40]}

In [21]:
fruitdf=pd.DataFrame(fruit)
fruitdf

   fruits  count
0   apple     10
1   mango     20
2  banana     30
3   guava     40

## Creating a dataframe using a numpy array

In [53]:
import numpy as np
numpyarray=np.array([[50000,60000],['John','James']])
df=pd.DataFrame({'name':numpyarray[1],'salary':numpyarray[0]})
df

    name salary
0   John  50000
1  James  60000

## performing merge operation

In [55]:
import pandas as pd
player=['siri1','siri2','siri3']
point=[10,9,8]
title=['game1','game2','game3']
df1=pd.DataFrame({'Player':player,'Points':point,'Title':title})
df1

  Player  Points  Title
0  siri1      10  game1
1  siri2       9  game2
2  siri3       8  game3

In [56]:
player=['siri1','siri5','siri6']
power = ['punch','kick','elbow']
title = ['game1','game5','game6']
df2=pd.DataFrame({'Player':player,'Power':power,'Title':title})
df2

  Player  Power  Title
0  siri1  punch  game1
1  siri5   kick  game5
2  siri6  elbow  game6

In [57]:
#inner merge
df1.merge(df2,on='Title',how='inner')

  Player_x  Points  Title Player_y  Power
0    siri1      10  game1    siri1  punch

In [58]:
#left merge
df1.merge(df2,on='Player',how='left')

  Player  Points Title_x  Power Title_y
0  siri1      10   game1  punch   game1
1  siri2       9   game2    NaN     NaN
2  siri3       8   game3    NaN     NaN

In [59]:
#right merge
df1.merge(df2,on='Player',how='right')

  Player  Points Title_x  Power Title_y
0  siri1    10.0   game1  punch   game1
1  siri5     NaN     NaN   kick   game5
2  siri6     NaN     NaN  elbow   game6

In [60]:
#outer merge
df1.merge(df2,on='Player',how='outer')

  Player  Points Title_x  Power Title_y
0  siri1    10.0   game1  punch   game1
1  siri2     9.0   game2    NaN     NaN
2  siri3     8.0   game3    NaN     NaN
3  siri5     NaN     NaN   kick   game5
4  siri6     NaN     NaN  elbow   game6

## performing join operation

In [87]:

player=['siri1','siri2','siri3']
point=[10,9,8]
title=['game1','game2','game3']
df3=pd.DataFrame({'Players':player,'Points':point,'Titles':title},index = ['L1','L2','L3'])
df3

   Players  Points Titles
L1   siri1      10  game1
L2   siri2       9  game2
L3   siri3       8  game3

In [89]:
player=['siri1','siri5','siri6']
power = ['punch','kick','elbow']
title = ['game1','game5','game6']
df4=pd.DataFrame({'Player':player,'Power':power,'Title':title},index = ['L2','L3','L4'])
df4

   Player  Power  Title
L2  siri1  punch  game1
L3  siri5   kick  game5
L4  siri6  elbow  game6

In [90]:
#inner join
df3.join(df4,how='inner')

   Players  Points Titles Player  Power  Title
L2   siri2       9  game2  siri1  punch  game1
L3   siri3       8  game3  siri5   kick  game5

In [91]:
#left join
df3.join(df4,how='left')

   Players  Points Titles Player  Power  Title
L1   siri1      10  game1    NaN    NaN    NaN
L2   siri2       9  game2  siri1  punch  game1
L3   siri3       8  game3  siri5   kick  game5

In [92]:
#right join
df3.join(df4,how='right')

   Players  Points Titles Player  Power  Title
L2   siri2     9.0  game2  siri1  punch  game1
L3   siri3     8.0  game3  siri5   kick  game5
L4     NaN     NaN    NaN  siri6  elbow  game6

In [93]:
#outer join
df3.join(df4,how='outer')

   Players  Points Titles Player  Power  Title
L1   siri1    10.0  game1    NaN    NaN    NaN
L2   siri2     9.0  game2  siri1  punch  game1
L3   siri3     8.0  game3  siri5   kick  game5
L4     NaN     NaN    NaN  siri6  elbow  game6

###  concatinating two dataframes in pandas

In [94]:
pd.concat([df3,df4])

   Players  Points Titles Player  Power  Title
L1   siri1    10.0  game1    NaN    NaN    NaN
L2   siri2     9.0  game2    NaN    NaN    NaN
L3   siri3     8.0  game3    NaN    NaN    NaN
L2     NaN     NaN    NaN  siri1  punch  game1
L3     NaN     NaN    NaN  siri5   kick  game5
L4     NaN     NaN    NaN  siri6  elbow  game6